---
kind: method
id: M:Autodesk.Revit.DB.RoutingPreferenceManager.Dispose
source: html/2ece8bd3-b04a-cd84-7e20-5fff75648482.htm
---
# Autodesk.Revit.DB.RoutingPreferenceManager.Dispose Method

Releases all resources used by the RoutingPreferenceManager

## Syntax (C#)
```csharp
public void Dispose()
```